# ExternallyTaggedNonBReps Class

---
Holds a collection of ExternallyTaggedNonBRep instances.
SystemObject Autodesk.Revit.DBExternallyTaggedNonBReps
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExternallyTaggedNonBReps : IDisposable

    Public Class ExternallyTaggedNonBReps
    	Implements IDisposable

    public ref class ExternallyTaggedNonBReps : IDisposable

    type ExternallyTaggedNonBReps =
        class
            interface IDisposable
        end
The ExternallyTaggedNonBReps type exposes the following members.
| Name| Description
---|---|---
| ExternallyTaggedNonBReps|  Make a new empty collection of ExternallyTaggedNonBRep instances.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Add|  Adds a copy of the input ExternallyTaggedNonBRep to this collection.
| CanAddExternallyTaggedNonBRep|  Checks if the input geometry could be added to this collection or not.
| Dispose| Releases all resources used by the ExternallyTaggedNonBReps
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace